{
  "projects": [
    {
      "title": "Neuentwicklung E-Shops der Witt-Gruppe",
      "role": "Senior Frontend Developer",
      "customer": {
        "name": "Witt Gruppe",
        "location": "Weiden"
      },
      "contractor": "Computer Futures / SThree GmbH",
      "period": {
        "start": "2019-04",
        "end": "2020-09"
      },
      "links": [
        "https://www.witt-weiden.de",
        "https://www.ambria.de",
        "https://www.creation-l.de",
        "https://www.heine.de",
        "https://www.sieh-an.de",
        "https://www.your-look-for-less.nl",
        "https://www.witt-international.cz",
        "https://www.waeschepur.de"
      ],
      "description": [
        "In meiner Rolle als Consultant führte ich die Witt-Gruppe durch den komplexen Prozess der Ablösung und Neuentwicklung von 17 Online-Shops. Mein Beitrag zielte darauf ab, eine skalierbare und wartungsfreundliche Lösung zu schaffen, die eine Multi-Brand-Unterstützung im internationalen Kontext bietet. Durch die Anwendung agiler Methoden wie Scrum und Kanban und die Implementierung von Continuous Deployment Strategien gelang es uns, die Effizienz zu steigern und einen reibungslosen Übergang von den Altsystemen zu gewährleisten."
      ],
      "technologies": [
        "Next.js",
        "React",
        "StyledComponents",
        "Contentful",
        "Backbone von ABOUT YOU",
        "Apollo GraphQL",
        "Kubernetes",
        "Vault (AWS)"
      ]
    },
    {
      "title": "WISE",
      "role": "Senior Frontend Architekt",
      "customer": {
        "name": "DWS",
        "location": "Frankfurt am Main"
      },
      "contractor": "Questax GmbH",
      "period": {
        "start": "2016-04",
        "end": "2019-03"
      },
      "links": ["https://www.deutscheinvest.lu/"],
      "description": [
        "Bei der Unterstützung der DWS in der Entwicklung einer digitalen White-Label-Investmentplattform trug ich wesentlich zur Konzeption und Realisierung bei. Mein Einsatz umfasste die Integration der Plattform in über zehn europäische und asiatische Investmentplattformen sowie die Mitwirkung an einem innovativen, auf React basierenden Frontend-Framework. Diese Zusammenarbeit verdeutlichte meine Fähigkeit, führende Finanzinstitute bei der digitalen Transformation zu unterstützen."
      ],
      "technologies": ["React", "ReactNative", "HTML5"]
    },
    {
      "title": "OneNumber-App für Geschäftskunden",
      "role": "Senior Application Architect",
      "customer": {
        "name": "Deutsche Telekom AG",
        "location": "Darmstadt"
      },
      "contractor": "Proventa, Frankfurt",
      "period": {
        "start": "2015-03",
        "end": "2015-07"
      },
      "additionalPeriod": {
        "start": "2016-03",
        "end": "2016-08"
      },
      "links": ["http://one-number-app.telekom.de"],
      "description": [
        "In einem Projekt für die Deutsche Telekom entwickelte ich als Consultant eine mobile Applikation, die es Geschäftskunden ermöglicht, das 'OneNumber'-Merkmal einfach einzustellen. Meine Verantwortung erstreckte sich über die plattformübergreifende Entwicklung für iOS, Android, BlackBerry, Amazon FirePhone und Windows Phone, um eine umfassende Nutzerbasis zu bedienen und die Effizienz in der Geschäftskommunikation zu steigern."
      ],
      "technologies": ["HTML5", "AngularJS", "Android", "OAuth2"]
    },
    {
      "title": "JAKO-O Geschenketisch",
      "role": "Senior Application Architect",
      "customer": {
        "name": "JAKO-O",
        "location": "Bad Rodach"
      },
      "contractor": "Epresia GmbH",
      "period": {
        "start": "2015-07",
        "end": "2016-03"
      },
      "links": ["https://www.jako-o.de/geschenketisch"],
      "description": [
        "Für JAKO-O leitete ich die technische Konzeption und Implementierung eines digitalen Geschenketisches (Wunschzettel) im Online-Shop. Als Consultant arbeitete ich eng mit dem Kundenteam zusammen, um eine Lösung zu entwickeln, die das Einkaufserlebnis verbessert und eine nachhaltige Kundenbindung fördert."
      ],
      "technologies": ["NodeJS", "ExpressJS", "VueJS", "Mobile Web"]
    },
    {
      "title": "JAKO-O Geschenkeberater für Smartphones",
      "role": "Senior Application Architect",
      "customer": {
        "name": "JAKO-O",
        "location": "Bad Rodach"
      },
      "contractor": "Epresia GmbH",
      "period": {
        "start": "2015-05",
        "end": "2015-07"
      },
      "links": ["https://www.jako-o.de/geschenkeberater"],
      "description": [
        "Bei der Entwicklung eines Geschenkeberaters für mobile Plattformen auf Basis der Produktscores des JAKO-O Online-Shops spielte ich eine Schlüsselrolle als Consultant. Die Realisierung dieses Projekts demonstriert meine Expertise in der Schaffung personalisierter und benutzerorientierter Shopping-Lösungen, die auf detaillierten Datenanalysen basieren und die Servicequalität signifikant erhöhen."
      ]
    },
    {
      "title": "SUZUKI E-Learning-Plattform",
      "role": "FullStack Senior User Interface Architect",
      "customer": {
        "name": "SUZUKI",
        "location": "Bensheim"
      },
      "contractor": "DIU MarTech Solutions GmbH",
      "period": {
        "start": "2014-07",
        "end": "2014-09"
      },
      "description": [
        "Als Consultant für Suzuki Deutschland konzipierte und entwickelte ich eine E-Learning-Plattform, die speziell auf die Vorbereitung von Zertifizierungen für das deutsche Händlernetz zugeschnitten war. Meine Aufgabe umfasste die gesamte Bandbreite von der Gestaltung des Endbenutzerfrontends bis zur Entwicklung der Redaktions- und Administrations-Oberflächen. Durch diese umfassende Lösung konnte ich maßgeblich zur Professionalisierung und Effizienzsteigerung im Schulungsprozess beitragen."
      ]
    },
    {
      "title": "UI für virtuelles Rechenzentrum",
      "role": "Frontend-Entwickler",
      "customer": {
        "name": "Großbank",
        "location": "Frankfurt am Main"
      },
      "contractor": "arago Consulting GmbH",
      "period": {
        "start": "2014-02",
        "end": "2014-06"
      },
      "description": [
        "Bei der Entwicklung einer Benutzeroberfläche für das einfache Erstellen und Verwalten virtueller Rechenzentren übernahm ich als Consultant die Führung. Dieses Projekt, das eine HTML5-Benutzeroberfläche in Ember.js für Desktop und Tablets umfasste, zielte darauf ab, Nutzern eine intuitive und effektive Möglichkeit zur Ermittlung des besten Angebots verschiedener Anbieter zu bieten. Meine Rolle beinhaltete die Implementierung eines komplexen Drag-and-Drop-Editors, der die Benutzererfahrung erheblich verbesserte."
      ],
      "technologies": ["HTML5", "EmberJS", "Drag&Drop"]
    },
    {
      "title": "PagePlace und Tolino (E-Publishing für Bücher)",
      "role": "JavaScript-Entwickler",
      "customer": {
        "name": "Deutsche Telekom AG",
        "location": "Darmstadt"
      },
      "contractor": "axxessio GmbH",
      "period": {
        "start": "2010-06",
        "end": "2013-09"
      },
      "description": [
        "Als Softwareberater trug ich zur HTML5-Architektur der PagePlace-Reader-Applikation bei, indem ich auf Basis von Unify eine Lösung für das Parsen und Darstellen von ePub-Dokumenten sowie eine HTML5-Lösung für die korrekte Darstellung von PDF-Dokumenten entwickelte. Diese Technologien integrierte ich erfolgreich in native Android- und iOS-Apps, was die Reichweite und das Leseerlebnis der Endnutzer signifikant verbesserte."
      ],
      "technologies": [
        "JavaScript",
        "HTML5",
        "iOS",
        "Android",
        "Unify",
        "ePub",
        "PDF"
      ]
    },
    {
      "title": "Unify Project - HTML5-JavaScript-Framework",
      "role": "JavaScript-Entwickler",
      "customer": {
        "name": "Deutsche Telekom AG",
        "location": "Darmstadt"
      },
      "contractor": "Proventa AG",
      "period": {
        "start": "2010-01",
        "end": "2013-09"
      },
      "description": [
        "In meiner Funktion als leitender Architekt und Entwickler eines HTML5 OpenSource Frameworks für mobile Applikationen nutzte ich modernste HTML5-Features zur Entwicklung in JavaScript. Dabei lag mein Fokus auf der Anpassung an gängige Mobilplattformen, um eine breite Kompatibilität und eine hohe Qualität der mobilen Anwendungen sicherzustellen."
      ],
      "technologies": ["JavaScript", "HTML5", "iOS", "Android"]
    },

    {
      "title": "DINA Frontend Neu (Analysesoftware)",
      "role": "PHP-/JavaScript-Entwickler",
      "customer": {
        "name": "Deutsche Telekom",
        "location": "Darmstadt"
      },
      "period": {
        "start": "2008-05",
        "end": "2009-12"
      },
      "description": [
        "Ich leitete die Konzeption und prototypische Entwicklung einer webbasierten Anwendung für das Management, die es ermöglichte, KPIs der konzernweiten IT-Infrastruktur darzustellen und langfristig zu analysieren. Meine Expertise ermöglichte es, Transparenz und Effizienz in der Unternehmenssteuerung zu steigern, indem ich die Daten zugänglich und nutzbar machte."
      ],
      "technologies": [
        "RESTful Middleware",
        "PHP",
        "CodeIgniter",
        "ExtJS",
        "FusionCharts",
        "Oracle"
      ]
    },
    {
      "title": "JourFixe (Besprechungsmanagement)",
      "role": "Java-Entwickler",
      "customer": {
        "name": "3ado OHG",
        "location": "Mainz"
      },
      "period": {
        "start": "2007-05",
        "end": "2008-04"
      },
      "description": [
        "Bei der Entwicklung der Besprechungsmanagementsoftware JourFixe arbeitete ich eng mit dem Kundenteam zusammen, um eine webbasierte Applikation zu schaffen, die nicht nur das zeitliche Besprechungsmanagement optimiert, sondern auch das Anlegen und Teilen von Besprechungsprotokollen vereinfacht. Durch die Implementierung einer klaren Softwarearchitektur und eines robusten Datenbankmodells konnte ich die Organisation und Kommunikation innerhalb von Unternehmen signifikant verbessern."
      ],
      "technologies": [
        "Java",
        "Spring Framework",
        "Hibernate",
        "JPA",
        "Spring Security"
      ]
    },
    {
      "title": "soSmart.de (Social Shopping)",
      "role": "PHP-Entwickler",
      "customer": {
        "name": "Netz98 GmbH",
        "location": "Mainz"
      },
      "period": {
        "start": "2006-10",
        "end": "2007-03"
      },
      "description": [
        "Für das Projekt soSmart.de, eine Social-Shopping-Plattform, war ich für die Integration von Affiliate-Netzwerken und die Entwicklung einer modernen Web 2.0-Oberfläche verantwortlich. Meine Arbeit umfasste die Implementierung einer intelligenten Echtzeitsuche und eines unscharfen Parsers, was die Nutzererfahrung durch schnelle und präzise Suchergebnisse erheblich verbesserte."
      ],
      "technologies": [
        "PHP",
        "SOAP",
        "REST",
        "MySQL",
        "Zend Framework",
        "PrototypeJS"
      ]
    },
    {
      "title": "Value Manager (Kreditsteuerungstool)",
      "role": "Java- und SAS-Entwickler",
      "customer": {
        "name": "Commerzbank AG",
        "location": "Frankfurt am Main"
      },
      "period": {
        "start": "2006-03",
        "end": "2006-10"
      },
      "description": [
        "Im Rahmen meiner Mitentwicklung am Kreditsteuerungstool Value Manager für die Commerzbank fokussierte ich mich auf die Verwendung von Java und SAS zur Datenaggregierung im Backend. Diese technologische Lösung unterstützte die Kreditverwaltung der Berater vor Ort durch präzise Datenanalysen und verbesserte Entscheidungsfindungsprozesse."
      ],
      "technologies": ["Java", "JSP", "Basic SAS"]
    },
    {
      "title": "Promoterverwaltung",
      "role": "PHP-Entwickler",
      "customer": {
        "name": "Creative Communication",
        "location": "Bingen"
      },
      "period": {
        "start": "2006-03",
        "end": "2006-10"
      },
      "description": [
        "Bei der Entwicklung einer webbasierten Applikation zur Verwaltung von Promotionaufträgen und Promotern nutzte ich meine Fähigkeiten in PHP, HTML und MySQL, um eine Lösung zu schaffen, die eine effiziente Kommunikation über SMS ermöglicht. Diese Applikation vereinfachte das Management von Promoter-Daten erheblich und steigerte die Effektivität von Marketingaktionen."
      ],
      "technologies": ["PHP", "MySQL", "HTML"]
    },
    {
      "title": "Anforderungsmanagement für BIX@ Supply Chain Management",
      "role": "Entwickler",
      "customer": {
        "name": "Boehringer Ingelheim International GmbH",
        "location": "Ingelheim am Rhein"
      },
      "period": {
        "start": "2000",
        "end": "2001"
      },
      "description": [
        "Ich unterstützte die Implementierung einer neuen Supply Chain Management-Software durch die Entwicklung eines softwarebasierten Anforderungsmanagements mit automatischen Regressionstests. Meine Arbeit trug dazu bei, die Zuverlässigkeit und Effizienz der Softwarelösung durch automatische Überprüfungen und Dokumentationen zu erhöhen, was die Qualität der Supply Chain Prozesse maßgeblich verbesserte."
      ]
    }
  ]
}
