{
  "projects": [
    {
      "title": "Übernahme, Beratung und Weiterentwicklung der Buchungsstrecke für die Schweizer Bundesbahn (SBB)",
      "role": "Leitender Frontend Architekt",
      "customer": {
        "name": "Deutsche Telekom MMS GmbH",
        "location": "Dresden"
      },
      "contractor": "GULP Information Services GmbH, München",
      "period": {
        "start": "2024-03",
        "end": "2024-09"
      },
      "description": [
        "Analyse der bestehenden Technologie und Architektur, um Verbesserungsvorschläge zu erarbeiten und umzusetzen."
      ],
      "technologies": [],
      "testimonials": []
    },
    {
      "title": "Multi-Marken Kunden- und Support-Portale für Strom- und Gasanbieter",
      "role": "Lead Frontend Developer",
      "customer": {
        "name": "EnBW AG",
        "location": "Karlsruhe"
      },
      "contractor": "Michael Page, Düsseldorf",
      "period": {
        "start": "2022-06",
        "end": "2024-02"
      },
      "description": [
        "Meine Rolle umfasste die architektonische Beratung innerhalb des ReactJS-Frameworks für eine Reihe von Webanwendungen, die für den Drittmarkt entwickelt wurden. Dies schloss sowohl Portale für Endkunden als auch für interne Dienstleister, wie Support-Mitarbeiter, ein. Eine besondere Herausforderung bestand darin, die Anwendungen als White-Label-Produkte zu konzipieren, die flexibel genug waren, um eine breite Palette von Markenanpassungen zu unterstützen – von Farbschemata und Logos bis hin zu spezifischen Funktionalitäten.",
        "Die Skalierbarkeit und Anpassungsfähigkeit dieser Plattformen waren entscheidend, um sie für verschiedene Marken und Unternehmen attraktiv zu machen. Die technologische Basis, die ich für das Kundenberater-Portal entwickelte, diente anderen Teams als Vorlage und Inspiration für ihre eigenen Projekte. Zusätzlich war ich für die Entwicklung wiederverwendbarer Komponenten verantwortlich, die über einzelne Projekte hinweg Einsatz fanden und somit die Konsistenz und Effizienz in der Entwicklung förderten.",
        "Ein besonderes Augenmerk lag auf der Schaffung responsiver Portale, die eine optimale Anzeige auf verschiedensten Desktop-Systemen ermöglichten. Wenngleich der Fokus nicht primär auf mobilen Endgeräten lag, so war die Flexibilität zwischen unterschiedlichen Desktop-Umgebungen ein zentrales Element.",
        "Ein wesentlicher Bestandteil meiner Arbeit war auch das Einrichten und Pflegen der Entwicklungsinfrastruktur, wobei ich mich für innovative Lösungen wie ein Mono-Repository und eine umfangreiche Testabdeckung durch Storybook entschied. Diese Initiativen trugen maßgeblich zu einer effizienten, kollaborativen Arbeitsumgebung bei und setzten neue Standards für die Projektentwicklung und -qualität."
      ],
      "technologies": [
        "TurboRepo",
        "PNPM",
        "ReactJS",
        "TypeScript",
        "Radix UI",
        "Downshift",
        "React Hook Form",
        "Vanilla Extract",
        "i18Next",
        "Jotai",
        "Framer Motion",
        "Storybook",
        "Vite",
        "Vitest",
        "ESLint",
        "Playwright"
      ],
      "testimonials": [
        {
          "author": "Patrick Krumm",
          "position": "Software-Entwickler/-Architekt, EnBW AG",
          "text": "Ich empfehle Sebastian mit großem Enthusiasmus für jede Rolle oder jedes Projekt, das tiefgreifende Fachkenntnisse in der Web-Frontend-Entwicklung, außergewöhnliche Führungsqualitäten in der Teamorganisation und strategische Entscheidungsfähigkeiten erfordert. Da ich das Privileg hatte, mit Sebastian zusammenzuarbeiten, habe ich aus erster Hand erfahren, welchen Einfluss er auf unsere Projekte hat, indem er Innovation und Exzellenz auf Schritt und Tritt vorantreibt. Sebastians Verständnis für aktuelle Technologien in der Webentwicklung ist herausragend. Er hält sich nicht nur über die neuesten Trends und Tools auf dem Laufenden, sondern besitzt auch die seltene Fähigkeit zu erkennen, welche davon am effektivsten eingesetzt werden können, um die Projektergebnisse zu verbessern. Seine Empfehlungen und Entscheidungen beruhen stets auf einer sorgfältigen Analyse und einem vorausschauenden Ansatz, der sicherstellt, dass unsere Projekte nicht nur erfolgreich, sondern auch zukunftssicher sind. Über seinen technischen Scharfsinn hinaus ist Sebastian eine natürliche Führungspersönlichkeit. Seine Herangehensweise an die Organisation und Führung von Teams ist sowohl inspirierend als auch effektiv und fördert ein Umfeld der Zusammenarbeit, des Lernens und der hohen Leistung. Unter seiner Leitung waren unsere Teams in der Lage, ehrgeizige Ziele zu erreichen und die Erwartungen in Bezug auf Qualität und Pünktlichkeit oft zu übertreffen. Sebastians Rollen als Senior Developer, Frontend Architect und Frontend Lead haben seine Vielseitigkeit und sein Durchsetzungsvermögen unter Beweis gestellt und ihn zu einer unschätzbaren Bereicherung in jedem Projektszenario gemacht. Seine Fähigkeit, diese Rollen mit Bravour auszufüllen, spricht Bände über seine Kompetenz, seine strategische Denkweise und sein Engagement für hervorragende Leistungen. Für jedes Unternehmen, das seine Webentwicklungsprojekte zu neuen Höhenflügen führen möchte, ist Sebastian der ideale Kandidat."
        },
        {
          "author": "Jochen Reinelt",
          "position": "Team Lead - Software Engineering Digital Services, EnBW AG",
          "text": "Sebastian ist ein Top-Experte für die Entwicklung von Web-Frontends, mit einem hervorragenden Überblick über aktuelle Technologien, sowie erfolgreiche Team-Organisation. Mit seiner großen Erfahrung ist er ein wertvoller Berater in Entscheidungs- und Auswahlprozessen, sowie in der Erarbeitung von Entwicklungsrichtlinien. Seine Empfehlungen oder Entscheidungen trifft er stets wohlüberlegt und kann diese detailliert begründen. Aufgrund seiner hohen Kompetenz und Durchsetzungsstärke kann er in Projekten verschiedene Rollen erfolgreich ausfüllen, vom Senior Developer bis zum Frontend Architect oder Frontend Lead."
        },
        {
          "author": "Emanuele De Monte",
          "position": "Product Owner, EnBW AG",
          "text": "Während unserer gemeinsamen Zeit bei EnBW habe ich Sebastian als Dienstleister kennengelernt und ihn als außergewöhnlich kompetenten und engagierten Lead Front End Developer erlebt. Sebastian verfügt über ein umfangreiches Wissen über die neuesten Frontend-Technologien und zeigt eine bemerkenswerte Fähigkeit, komplexe Probleme kreativ und effizient zu lösen. Er hat eine Schlüsselrolle dabei gespielt, das Projekt zur Entwicklung innovativer und benutzerfreundlicher Webanwendungen voranzutreiben. Ich möchte mich für die gemeinsame Zeit bedanken und freue mich auf die Fertigstellung des Projekts."
        },
        {
          "author": "Kai Santanius",
          "position": "Frontend Consultant",
          "text": "Sebastian ist ein bemerkenswerter Mentor und Kollege. Sein umfangreiches Wissen und seine Bereitschaft, sein Fachwissen mit anderen zu teilen, sind für unser gesamtes Team von großem Vorteil, und ich möchte ihn nicht mehr missen. Eine von Sebastians hervorragendsten Eigenschaften ist seine Bereitschaft, zuzuhören und Ratschläge zu geben. Wann immer ich auf eine Herausforderung stieß, hatte Sebastian ein geduldiges Ohr und praktische Lösungen parat. Seine Ratschläge und Einsichten waren für mich von unschätzbarem Wert, sowohl beruflich als auch persönlich. Ich kann Sebastian mit gutem Gewissen als engagierten und sachkundigen Fachmann empfehlen, mit dem man rundherum hervorragend zusammenarbeiten kann. Er wird für jede Organisation eine wertvolle Bereicherung sein."
        },
        {
          "author": "Tobias Arweiler",
          "position": "Freelancer, Senior Software-Entwickler",
          "text": "Sebastian ist ein überaus professioneller, sehr erfahrener Softwarearchitekt, der weiß, wovon er spricht. In unserem gemeinsamen Projekt bei der EnBW war er eine wichtige Stimme für eine vernünftige und technologisch fundierte Software-Architektur, sowie ein großartiger Sparringspartner für jede technologische Frage oder Idee, die man aufwerfen wollte. Jedes Projektteam würde sich freuen, ihn als Teammitglied zu haben, da er sowohl bei der technischen Umsetzung als auch bei komplexen Architekturdiskussionen unterstützen kann. Ich wünsche ihm alles Gute."
        },
        {
          "author": "Rouven Haban",
          "position": "Scrum Master, scrum asset",
          "text": "Ich hatte das Privileg, mehr als ein Jahr lang mit Sebastian als Scrum Master zu arbeiten. Sebastian ist ein außergewöhnlicher Lead Developer, dessen tiefgreifende technische Expertise und innovative Denkweise unser Team konsequent zum Erfolg führt. Seine Fähigkeit, komplexe Konzepte in klare, umsetzbare Lösungen zu übersetzen, ist in unserer agilen Umgebung von unschätzbarem Wert. Sebastian leitet mit Leichtigkeit an und inspiriert unser Team zu neuen Höchstleistungen. Unter seiner Leitung haben wir erhebliche Verbesserungen bei der Effizienz und der Produktqualität festgestellt. Ich empfehle Sebastian von ganzem Herzen für jede fortgeschrittene Entwicklungsaufgabe. Er ist nicht nur ein hochqualifizierter Entwickler, sondern auch ein echter Teamplayer, der für jedes Projekt, an dem er beteiligt ist, einen immensen Wert darstellt."
        }
      ]
    },
    {
      "title": "IOT-Plattform zur Überwachung von Maschinen und Anlagen",
      "role": "Senior React Developer",
      "customer": { "name": "Azeti GmbH", "location": "Berlin" },
      "contractor": "Staffgroup GmbH, Berlin",
      "period": {
        "start": "2022-03",
        "end": "2022-05"
      },
      "technologies": ["NX", "React Intl", "Mono Repository"],
      "description": [
        "Bei der Entwicklung einer umfangreichen Frontend-Applikation für die Überwachung von Maschinen auf Basis von ReactJS, meisterte ich technische Herausforderungen wie das Mono-Repository-Setup mit NX, Internationalisierung, und Theming für White Label-Lösungen. Die Bewältigung dieser Herausforderungen und der Umgang mit großen Datenmengen demonstrierten meine Fähigkeit, komplexe Anforderungen effizient umzusetzen."
      ]
    },
    {
      "title": "Kundenportal zur Pflege von Basisdaten und der Verwaltung von PV-Anlagen",
      "role": "Lead Web Frontend Architekt",
      "customer": { "name": "Netze BW GmbH", "location": "Stuttgart" },
      "contractor": "Hays AG, Mannheim",
      "period": {
        "start": "2021-02",
        "end": "2022-02"
      },
      "description": [
        "Ich übernahm die architekturelle Verantwortung für die Frontend-Architektur, entwickelte Verbesserungsvorschläge für bestehende Strukturen und skizzierte Architekturen für neue Entwicklungen. Durch die Anwendung von API-First-Entwicklung und die Implementierung von End-to-End Tests mit Cypress, erreichte ich eine Code-Coverage von 70% für das bestehende Kundencenter, was eine solide Basis für die Qualitätssicherung in zukünftigen Releases bildete."
      ],
      "technologies": ["Cypress", "JavaScript", "React"],
      "testimonials": [
        {
          "author": "Florian Matz",
          "position": "Professional Software-Engineer, Netze BW GmbH",
          "text": "Sebastian überzeugt mit seinem tiefen Fachwissen in Sachen Frontend-Architektur, Tooling und React im Speziellen. Dabei kommuniziert er ehrlich und bringt mit seiner Kompetenz jede Codebasis voran. Vielen Dank, es hat Spaß gemacht!"
        },
        {
          "author": "Yangyang Gao",
          "position": "Lead Consultant Fullstack, CGI Deutschland",
          "text": "Sebastian arbeitet selbstständig an allen Aufgaben, die in der täglichen Projektarbeit anfallen. Er ist ein ausgewiesener Experte im Frontend-Bereich und steht jederzeit mit seinem Know-how zur Verfügung. Bei der Analyse der Frontend-Architektur hat er viele sinnvolle Verbesserungsmöglichkeiten gefunden und mit Hilfe von Best Practices pragmatisch umgesetzt. Seine Lösungsvorschläge und Diskussionsbeiträge sind immer ein elementarer Input."
        }
      ]
    },
    {
      "title": "Multi-Marken Online-Shop-Plattform in der Otto-Gruppe",
      "role": "React- und GraphQL-Architekt",
      "customer": {
        "name": "empiriecom GmbH & Co. KG",
        "location": "Burgkunstadt"
      },
      "contractor": "AWESOME! Software GmbH, Montabaur",
      "period": {
        "start": "2020-11",
        "end": "2021-02"
      },
      "description": [
        "In meinem Verantwortungsbereich lag die Erweiterung und Optimierung unseres GraphQL-Services, ein Prozess, der die Integration neuer Resolver und eine Anbindung an eine MySQL-Datenbank umfasste. Die Herausforderung bestand darin, nicht nur die Systemfunktionalität zu erweitern, sondern auch die Qualität und Wartbarkeit des Gesamtsystems durch gezielte Verbesserungen zu erhöhen. Durch die Einführung verbesserter Typisierung, die konsequente Nutzung von Async/Await, die Optimierung der Testbarkeit und die Verfeinerung unseres Toolings konnte ich einen signifikanten Beitrag zur Steigerung der Systemeffizienz leisten.",
        "Zusätzlich nahm ich maßgeblich Einfluss auf die architektonische Weiterentwicklung unserer internen Komponentenbibliothek. Diese Arbeit ermöglichte es, die Modularität und Wiederverwendbarkeit unserer Softwarekomponenten zu verbessern, was wiederum die Entwicklungseffizienz und Systempflege erleichterte. Mein Einsatz führte zu einer spürbaren Verbesserung der Systemqualität und trug dazu bei, das Fundament für zukünftige Innovationen zu legen."
      ],
      "technologies": [
        "MySQL",
        "React",
        "GraphQL",
        "Apollo Client",
        "Apollo Server",
        "TypeScript",
        "Jest"
      ],
      "testimonials": [
        {
          "author": "Sascha Metz",
          "position": "Web-Developer, Visuellagentur UG",
          "text": "Es war großartig, mit dir zu arbeiten. Ich werde deine Kompetenz, deinen Weitblick und unsere Gespräche vermissen. Viel Glück und denk daran: Man sieht sich immer zweimal im Leben. Das war eine Drohung. :)"
        },
        {
          "author": "Natalie Stoisch",
          "position": "Lead User Centered Design & Scrum Master Unit Search, empiriecom GmbH & Co. KG",
          "text": "Vielen Dank für deinen professionellen Einsatz. Du hast das Team mit deiner Unterstützung in vielerlei Hinsicht weitergebracht. Es war ein außerordentliches Vergnügen, mit Dir zu arbeiten."
        },
        {
          "author": "Alexander Ritz",
          "position": "Product Owner Business Intelligence, Analytics & Personalization, empiriecom GmbH & Co. KG",
          "text": "Vielen Dank, dass Du uns bei unseren PACE-Projekten so tatkräftig unterstützt hast. Deine erfrischende und ehrliche Art hat uns an der einen oder anderen Stelle auf Konzeptlücken aufmerksam gemacht."
        }
      ]
    },
    {
      "title": "Neuentwicklung von State-of-the-Art Web-Anwendungen für einen führenden Baustoffkonzern",
      "role": "React-Architekt",
      "customer": { "name": "HeidelbergCement AG", "location": "Heidelberg" },
      "contractor": "Hays AG, Mannheim",
      "period": {
        "start": "2019-06",
        "end": "2020-09"
      },
      "description": [
        "Im Zuge der Weiterentwicklung und Erweiterung einer Webanwendung zur Verfolgung von LKWs mit Baumaterialien, war ich federführend bei der Entwicklung einer Heuristik für die visuelle Aufbereitung von LKW-Routen in einer Google-Maps-Ansicht. Ein zentraler Aspekt meiner Arbeit war die Einführung eines Mono-Repositories, um die Frontend-Entwicklung zu vereinheitlichen und die Implementierung automatisierter Tools für das Hosting in Azure und Azure CDN zu optimieren. Dies verbesserte nicht nur die Performance im Vergleich zur vorherigen Docker-basierten Lösung, sondern förderte auch eine effizientere und kollaborative Arbeitsweise im Team.",
        "Durch die Standardisierung von TypeScript und ESLint schaffte ich eine konsistente Entwicklungsgrundlage, die zusammen mit der Einführung von Cypress-basierten E2E-Tests zu einer qualitativ hochwertigeren Codebasis führte. Die schrittweise Migration der Codebasis auf TypeScript und die Implementierung eines verbesserten Axios-basierten API-Clients waren weitere Meilensteine, die zur Robustheit und Skalierbarkeit unserer Anwendung beitrugen.",
        "Als Sparringspartner für UX-Designer und in meiner Funktion als leitender Entwickler unterstützte ich die Gestaltung eines benutzerzentrierten UI-Frameworks. Meine Rolle beinhaltete die Entwicklung eines gemeinsamen Verständnisses für effektive Komponentenstrukturen und deren Umsetzung, wodurch wir innovative und benutzerfreundliche Lösungen realisieren konnten. Meine Beiträge wurden als wegweisend für die Art und Weise, wie wir Webanwendungen entwickeln und veröffentlichen, angesehen und haben maßgeblich dazu beigetragen, unseren technologischen Stack zu verbessern und das Team zu inspirieren, bestehende Grenzen zu überwinden und kontinuierlich dazuzulernen."
      ],
      "technologies": [
        "React",
        "Redux",
        "React Router",
        "i18next",
        "React Hooks",
        "Lerna",
        "Prettier",
        "ESLint",
        "TypeScript",
        "Azure",
        "Jest",
        "Cypress"
      ],
      "testimonials": [
        {
          "author": "Christian Klaucke",
          "position": "Head of Digital Product Engineering, HeidelbergCement AG",
          "text": "Vielen Dank für all Deine Leistungen, Sebastian! Und wow, ich habe gar nicht bemerkt, dass wir fast 1,5 Jahre zusammen gearbeitet haben. Es gibt jetzt wirklich eine sehr große Lücke, die das Team zu füllen hat, da Du etliche wichtige Beiträge zu unserem Stack hinzugefügt hast. Du hast Dir im Laufe der Zeit einen sehr guten Ruf als React-Experte im Team erworben, und ich hatte das Gefühl, dass die Leute Deinem Rat wirklich tiefgehend vertrauen. Ich wünsche Dir alles Gute für Deinen zukünftigen Weg und möge der Code mit Dir sein. Immer."
        },
        {
          "author": "Danny Fürniß",
          "position": "Lead Product Engineer, HeidelbergCement AG",
          "text": "Danke Sebastian. Es war mir ein Vergnügen, mit Dir zu arbeiten und mit Dir über die winzigen aber wichtigen Details moderner Web-Technologie-Stacks zu diskutieren. Zusammen konnten wir die Art und Weise, wie wir unsere Web-Anwendungen entwickeln und veröffentlichen, einen gewaltigen Sprung nach vorn bringen. Deine tiefgehende Erfahrung mit React und den sinnvollen Praktiken der Webentwicklung wurden von mir immer sehr geschätzt."
        },
        {
          "author": "Igor Ilic",
          "position": "Software Engineer, HeidelbergCement AG",
          "text": "Während unserer Zusammenarbeit mit Sebastian wurden mein Team und ich Zeuge, wie eine sachkundige und erfahrene Person die Köpfe des gesamten Teams wachrütteln kann. Er zwang uns, mehr zu lernen und generell mehr zu hinterfragen. Auch, in die richtige Richtung zu lernen, damit wir dann selbst Lösungen finden konnten. Dem Team arbeitsfähige Lösungen zu geben, ist sicher wertvoll, aber es ist vorteilhafter, ihnen beizubringen, wie sie selbst denken und das Problem lösen können. Abgesehen davon habe ich die Gesellschaft von Sebastian sehr genossen und schätze es sehr, dass wir den Vorteil hatten, gemeinsam überlegene Lösungen für verschiedene komplexe Probleme zu finden."
        },
        {
          "author": "Dominik Skalnik",
          "position": "Software Engineer, HeidelbergCement AG",
          "text": "Es hat mich gefreut, mit Sebastian arbeiten zu können. Unser Projekt hat viel von seinem langjährigen Frontend Know-How profitiert. Er kennt sich nicht nur mit ReactJS gut aus, sondern hat auch das Gesamtsystem immer im Blick. Das kommt nicht oft vor. Er ist kommunikativ, engagiert und offen. Ich selbst würde mit ihm gerne immer wieder zusammenarbeiten und kann ihn für weitere Projekte nur empfehlen."
        },
        {
          "author": "Armin Naimi",
          "position": "Software Engineer, HeidelbergCement AG",
          "text": "Sebastian ist ein ausgezeichneter Entwickler und viel mehr ein Kollege und Coach, welcher mit scharfer Präzision hochqualitative Lösungen entwickelt. Sebastian hat Themen wie Backend für Frontend und Frontend Operations vorangebracht und unser Team mit einer Reihe von Tools bereichert. Ich wünsche ihm alles Gute und in seinem neuem Team viel Spaß und Erfolg."
        },
        {
          "author": "Cesare Cesari",
          "position": "UX Designer, HeidelbergCement AG",
          "text": "Als UX-Designer ist es großartig, mit Sebastian zu arbeiten. Seine benutzerzentrierte Denkweise unterstützte und forderte das Team und mich heraus. Er ist neugierig und hat nie Angst davor, die Komfortzone zu verlassen, wenn es darum geht, Qualität zu realisieren. Das ist mit Sicherheit ein Wert für jedes Unternehmen, mit dem er zusammenarbeitet."
        },
        {
          "author": "Sebastian Walter",
          "position": "Team Lead Frontend, HeidelbergCement AG",
          "text": "Sebastian zeichnet eine klare und direkte Kommunikation aus; sowohl in Besprechungen als auch im Quelltext. Für komplexe Probleme und Anforderungen sucht Sebastian einfache und zukunftsfähige Lösungen. Dabei greift er gerne auf seine Erfahrung aus früheren Projekten zurück. Beim Tooling ist er up to date und verfolgt mit Enthusiasmus neue Entwicklungen in der Branche."
        }
      ]
    },
    {
      "title": "Mentoring und Consulting für neues React-Team",
      "role": "React Mentor",
      "customer": { "name": "GE Healthcare", "location": "Freiburg" },
      "contractor": "Belcan Technical Recruiting, London",
      "period": {
        "start": "2019-02",
        "end": "2019-02"
      },
      "description": [
        "In einem intensiven, mehrtägigen Workshop zu Best Practices in der Frontend-Entwicklung mit einem Schwerpunkt auf React teilte ich mein Wissen über bewährte Konventionen, von der Ordnerstruktur bis hin zu Implementierungsstrategien. Der Workshop deckte ein breites Spektrum ab, einschließlich des effektiven Managements von Assets, der Einführung in TypeScript für eine verbesserte Typisierung und Strategien für die Interaktion mit serverseitigen Daten. Ein besonderer Fokus lag auf der Erörterung der Vorzüge und Herausforderungen funktionaler versus Klassen-Deklarationen in React sowie der Bedeutung von kontinuierlicher Weiterbildung durch Ressourcen wie Newsletter, Video-Kurse und Konferenzen.",
        "Darüber hinaus untersuchten wir Möglichkeiten zur Reduzierung von Boilerplate-Code bei der Verwendung von Redux durch das Duck-Pattern und initiierten Diskussionen über die Einsatzmöglichkeiten von GraphQL in Projekten. Das primäre Ziel dieses Workshops war, Teilnehmenden ein tiefgehendes Verständnis für die Nuancen moderner Frontend-Entwicklung zu vermitteln und ihnen handfeste Lösungsansätze für alltägliche Entwicklungsherausforderungen an die Hand zu geben."
      ],
      "technologies": ["React", "Redux", "TypeScript", "GraphQL"],
      "testimonials": [
        {
          "author": "Alexander Fechner",
          "position": "Software Engineer, GE Healthcare",
          "text": "Ich hatte das Vergnügen, von Sebastian während eines Coachings für den Aufbau einer auf React basierenden Unternehmensanwendung im Gesundheitswesen betreut zu werden. Er ist ein leidenschaftlicher Softwareentwickler, klar in seiner Kommunikation und ein produktiver Partner zum Gedankenaustausch. Er hat meine höchste Empfehlung."
        },
        {
          "author": "Stefan Huggle",
          "position": "Software Architect, GE Healthcare",
          "text": "Vielen Dank für unsere Beratungssitzung über HTML5/React-bezogene Technologien in Freiburg. Ihr breites Wissen im HTML5-Universum ist beeindruckend. Sie haben uns viele wertvolle Empfehlungen gegeben, die auf - und das ist das Wichtigste - echten praktischen Erfahrungen beruhen."
        }
      ]
    },
    {
      "title": "Responsive Multi-Marken mehrsprachigen E-Commerce-Neuentwicklung (Produktseiten, Warenkorb, Kundenkonto)",
      "role": "React/GraphQL-Architekt",
      "customer": {
        "name": "Josef Witt GmbH (Otto Gruppe)",
        "location": "Weiden"
      },
      "contractor": "Computer Futures/SThree GmbH, München",
      "period": {
        "start": "2018-09",
        "end": "2019-06"
      },
      "description": [
        "Die Herausforderung, einen Online-Shop neu zu entwickeln, der sowohl Multi-Brand-Fähigkeiten als auch internationale Unterstützung bietet, führte mich zur Implementierung einer GraphQL-Orchestration-Schicht mittels Apollo auf Client- und Serverseite. Diese Aufgabe umfasste nicht nur technische Neuerungen, sondern auch das Mentoring meines Teams, um ein tiefes Verständnis und eine effektive Anwendung der Technologien zu gewährleisten. Durch die Einführung serverseitigen Renderings (SSR) und einer fortschrittlichen Code-Splitting-Lösung mit Loadable Components konnte die Leistung und Nutzererfahrung des Shops signifikant gesteigert werden.",
        "Ein weiterer wichtiger Meilenstein war die Implementierung einer JWT-basierten, SSR-kompatiblen Nutzerzuordnung, die eine nahtlose Nutzererfahrung über verschiedene Sessions und Geräte hinweg ermöglichte. Durch Optimierungen im Bereich des Toolings, einschließlich Threading und Caching in Webpack, sowie der Umstellung des TypeScript-Toolings auf Babel, konnte ich die Entwicklungszeiten und die Hot Module Replacement (HMR)-Effizienz deutlich verbessern. Darüber hinaus trug die Optimierung des clientseitigen Routings und die Implementierung von Preloading für diverse Code-Split-Pfade zu einer reibungslosen und schnellen Navigation bei."
      ],
      "technologies": [
        "TypeScript",
        "React",
        "Styled Components",
        "Reach Router",
        "Apollo GraphQL",
        "Webpack"
      ],
      "testimonials": [
        {
          "author": "Abraham Schilling",
          "position": "Senior Frontend Developer, Josef Witt GmbH",
          "text": "Sebastian ist ein stets involviertes, dynamisches Teammitglied mit unschätzbarer Erfahrung im Bereich Tools und Web-Performance. Mit Sebastian im Team haben wir endlich ein zuverlässiges SSR/HMR-Setup mit einem unterhaltsamen Entwickler-Erlebnis. Er hat es uns leicht gemacht, auf GraphQL umzusteigen. Ich habe vor allem unsere Gespräche und unseren technischen Austausch genossen. Für mich persönlich war Sebastian ein Vorbild dafür, in Konfrontationssituationen ruhig und konstruktiv zu bleiben."
        }
      ]
    },
    {
      "title": "Neue ARD-Mediathek für HBBTV-fähige Fernseher und Web-Browser",
      "role": "React/GraphQL-Architekt",
      "customer": { "name": "SWR", "location": "Mainz" },
      "contractor": "GULP Information Services GmbH, München",
      "period": {
        "start": "2018-07",
        "end": "2018-09"
      },
      "description": [
        "Bei der Neu-Entwicklung einer Mediathek für alle Sender der ARD als gemeinsame Plattform lag mein Fokus auf der Unterstützung moderner HBBTV-fähiger Fernseher und der Bereitstellung responsiver Layouts für Web-Browser auf Handys, Tablets und Desktops. Ich war maßgeblich an der Entwicklung und Optimierung der GraphQL-Schnittstelle beteiligt, um eine effiziente Kommunikation mit bestehenden REST-APIs zu gewährleisten. Dieses Projekt zielte darauf ab, eine nahtlose und benutzerfreundliche Medienbibliothek zu schaffen, die den Zugriff auf Inhalte über eine Vielzahl von Geräten ermöglicht und dabei modernste Technologien nutzt."
      ],
      "technologies": [
        "React",
        "Apollo GraphQL",
        "Webpack",
        "Sass",
        "Flowtype",
        "HBBTV"
      ]
    },
    {
      "title": "Real-Time Verkehrs-Informationsangebot für den ÖPNV-Bereich",
      "role": "React Architekt",
      "customer": { "name": "Init SE", "location": "Karlsruhe" },
      "contractor": "Megapart GmbH, Karlsruhe",
      "period": {
        "start": "2018-04",
        "end": "2018-07"
      },
      "description": [
        "Bei der Neuentwicklung eines webbasierten Dashboards für Echtzeit-Abfahrsinformationen im ÖPNV-Umfeld übernahm ich die eigenverantwortliche Architektur und Entwicklung, in enger Absprache mit Produktmanagern. Ich traf die Auswahl aktueller Technologien und führte Schulungen für Mitarbeiter in den Bereichen React und Web-Entwicklung durch. Ein zentraler Bestandteil meiner Arbeit war die Entwicklung eines GraphQL-Servers mit Apollo, der eine Vielzahl unterschiedlicher REST-APIs, sowohl Inhouse als auch extern, nutzte. Für die Erkennung der Geo-Position und die Ermittlung von Routen und Distanzen setzte ich auf MapBox und OpenStreetMap. Darüber hinaus gestaltete ich das Seiten-Layout und setzte die ersten Design-Konzepte in wiederverwendbare Komponenten und Views um, um eine intuitive und effiziente Benutzeroberfläche zu schaffen."
      ],
      "technologies": [
        "React",
        "Formik",
        "Popmotion",
        "React Intl",
        "Reach Router",
        "DotEnv",
        "Webpack",
        "Babel",
        "PostCSS",
        "CSS Modules",
        "Storybook",
        "Jest",
        "ESLint",
        "Stylelint",
        "Prettier"
      ]
    },
    {
      "title": "Entwicklung eines Telematik-Angebotes für Logistikunternehmen",
      "role": "React Experte",
      "customer": {
        "name": "RIO - Volkswagen Truck & Bus",
        "location": "München"
      },
      "contractor": "Ray Sono AG, München",
      "period": {
        "start": "2018-01",
        "end": "2018-03"
      },
      "description": [
        "Bei der Unterstützung der Weiterentwicklung einer bereits von Kunden genutzten Plattform arbeitete ich in einem verteilten Team mit Standorten in Leipzig und München. Meine Rolle umfasste die Einbringung architektureller Verbesserungsvorschläge sowie das Mentoring von Kollegen, um die Qualität und Effizienz der Plattform zu steigern. Durch diese Zusammenarbeit trug ich zur Optimierung bestehender Prozesse und Strukturen bei, förderte den Wissensaustausch innerhalb des Teams und unterstützte die kontinuierliche Weiterentwicklung der Plattform, um den Anforderungen und Bedürfnissen der Nutzer noch besser gerecht zu werden."
      ],
      "technologies": [
        "React",
        "Redux",
        "Redux-Saga",
        "Webpack",
        "Babel",
        "Less",
        "ESLint",
        "Karma",
        "Mocha",
        "Sinon",
        "AWS",
        "Amazon S3"
      ],
      "testimonials": [
        {
          "author": "Stefan Hammer",
          "position": "Product Manager, Ray Sono AG",
          "text": "Sebastian Werner ist in einer späten Projektphase in ein fachlich wie technisch sehr komplexes Projekt eingestiegen und hat dort nach einer sehr kurzen Einarbeitungszeit nicht nur als vollwertiges Teammitglied mitgearbeitet, sondern auch direkt konstruktive Lösungsvorschläge zu Problemen in der Architektur und der Technik gegeben. Wir sind mit der Zusammenarbeit sehr zufrieden und würden uns freuen, auch zukünftige Projekte gemeinsam umzusetzen."
        },
        {
          "author": "Yolanda Cruz-Stempian",
          "position": "Partner Management, Ray Sono AG",
          "text": "Herr Werners Hauptaufgaben waren die Umsetzung von Formularen und Interaktionen in den Buchungsmodulen und Performance-Optimierungen im Chat und im Allgemeinen bzgl. der Ladezeit. Die ihm übertragenen Aufgaben wurden von Herrn Werner zu unserer vollsten Zufriedenheit bearbeitet. Mit sehr viel Einsatzbereitschaft und seiner kommunikativen Art hat sich Herr Werner schnell in unser Entwicklungsteam integriert und konnte in hohem Maße zum Projekterfolg beitragen."
        }
      ]
    },
    {
      "title": "Eine Plattform zum Austausch zwischen Pharma-Branche und Ärzten",
      "role": "Frontend Architekt",
      "customer": { "name": "coliquio GmbH", "location": "Konstanz" },
      "contractor": "Michael Page, München",
      "period": {
        "start": "2017-06",
        "end": "2017-12"
      },
      "description": [
        "Für das Projekt-Setup einer Green-Field React-Anwendung im Pharma-Bereich übernahm ich die Neustrukturierung der existierenden Komponenten-Library und führte eigene NPM Repositories ein. Diese Maßnahme diente der Erhöhung der Wiederverwendbarkeit von Komponenten und der Implementierung einheitlicher Linting-Regeln. Ich setzte auf responsive Design mit CSS Grid Layout und responsiver Typographie, um eine optimale Darstellung auf einer breiten Gerätevielfalt zu gewährleisten. Des Weiteren realisierte ich serverseitiges Rendering mit React, inklusive intelligentem Code-Splitting für JavaScript und CSS. Die Evaluierung und Auswahl von Oberflächen-Komponenten für Animationen, Charting und weitere Funktionen gehörten ebenfalls zu meinen Aufgaben, um eine benutzerfreundliche und visuell ansprechende Anwendung zu entwickeln."
      ],
      "technologies": [
        "React",
        "Redux",
        "Webpack",
        "Storybook",
        "ESLint",
        "Stylelint",
        "Prettier"
      ],
      "testimonials": [
        {
          "author": "Florian Eibeck",
          "position": "Software-Entwickler, Mayflower GmbH",
          "text": "Sebastian did a great job as a Frontend Engineer and Architect in our team. He happily shared his knowledge and teached us how to write state-of-the-art React applications. Thanks for the good collaboration, it was a pleasure working together!"
        },
        {
          "author": "Florian Geier",
          "position": "Selbständiger Software-Entwickler",
          "text": "Sebastians Expertise im Bereich moderner Web-Technologien ist umfassend und tiefgreifend, so dass die Zusammenarbeit für mich eine bereichernde Erfahrung war. Der Kunde profitierte zudem von seinem Engagement in diversen Open-Source Projekten, die uns bei der Umsetzung der Anforderungen zugute kamen."
        },
        {
          "author": "Jens Rusitschka",
          "position": "UX und Product Consulting",
          "text": "Ich habe mit Sebastian an einer neuen Plattform für Coliquio gearbeitet. Sein Wissen und seine Erfahrung mit Javascript, React-Technologie und modernen Front-End-Frameworks waren wirklich beeindruckend. Ich freue mich darauf, wieder mit ihm zusammenzuarbeiten!"
        }
      ]
    },
    {
      "title": "Neues Online-Banking für Geschäftskunden mit signifikaten Umsätzen",
      "role": "Lead Frontend Architekt",
      "customer": { "name": "Deutsche Bank AG", "location": "Eschborn" },
      "contractor": "Hays AG, Mannheim",
      "period": {
        "start": "2017-03",
        "end": "2017-06"
      },
      "description": [
        "Während des Aufbaus einer zukunftsweisenden Frontend-Architektur nahm ich eine Schlüsselrolle ein, indem ich eng mit Systemarchitekten und Produktmanagern zusammenarbeitete. Ein wichtiger Aspekt meiner Arbeit war die Führung und das Mentoring von zwei Offshore-Teams in Indien, für die ich den Git-Flow und Pull Requests als zentrale Arbeitsmethodik etablierte. Meine Verantwortung umfasste nicht nur die Schulung dieser Teams, sondern auch die Bewertung und Genehmigung ihres Codes, um die Einhaltung höchster Qualitätsstandards zu gewährleisten.",
        "Ein weiterer Schwerpunkt meiner Tätigkeit lag in der sorgfältigen Evaluierung neuer Technologien, um einen innovativen Technologie-Stack zu definieren, der in enger Zusammenarbeit mit verschiedenen Stakeholdern des Konzerns ausgewählt wurde. Darüber hinaus leitete ich die Analyse und Konzeption eines neuen Development 2.0 Environments, das darauf abzielte, die Produktivität der Softwareentwicklung signifikant zu steigern. Diese Initiative zielte darauf ab, eine effiziente, moderne Entwicklungsumgebung zu schaffen, die optimal auf die Anforderungen der Softwareentwicklung abgestimmt ist."
      ],
      "technologies": [
        "React",
        "Redux",
        "Webpack",
        "ESLint",
        "Stylelint",
        "REST"
      ],
      "testimonials": [
        {
          "author": "Makele Ghebreamlak",
          "position": "Consultant Software Architect, Melsicon GmbH",
          "text": "Ich habe mit Sebastian in einem agilen Projekt für ein Unternehmen im Banksegment gearbeitet. Er ist ein außergewöhnlich talentierter Frontend-Architekt und ReactJS-Entwickler mit einem sehr tiefen Verständnis von UX/UI. Sebastian hat eine persönliche Leidenschaft für die Entwicklung hochmoderner Web- und Mobilanwendungen. Seine Fähigkeit, neue Technologien aufzugreifen, liegt weit über dem Durchschnitt. Er sucht nie nach dem komfortablen Ansatz, er stellt das Design, die User Experience, die Art und Weise, wie wir arbeiten, wie wir Software produzieren, welche Technologien wir wählen, in Frage und geht damit weit über die Kundenerwartung hinaus, das beste Produkt zu entwickeln. Ich würde mich freuen, bei zukünftigen Projekten mit ihm zusammenzuarbeiten!"
        },
        {
          "author": "Michael Rodegast",
          "position": "Interims Management Consultant, Michael Rodegast Consulting",
          "text": "Ich hatte das Vergnügen, mit Sebastian durch seine Führung eines Backbone-Teams bei einem Kunden zusammenzuarbeiten, für den wir beide tätig sind. Sebastians Engagement, eine Innovationsagenda durch seine persönliche Identität und seine tiefgreifenden Software-Kenntnisse in die Unternehmensarchitektur unseres Kunden einzubringen, war von größter Bedeutung und führte zu großartigen Ergebnissen. Sebastian geht in seinem täglichen Arbeitsleben mit gutem Beispiel voran und ermutigte daher nicht nur sein Backbone-Team, sondern auch das Projektteam selbst. Ich würde mich freuen, in Zukunft wieder zusammenarbeiten zu können, wenn sich die Gelegenheit dazu bietet."
        },
        {
          "author": "Adib Istanbouli",
          "position": "Senior Software Developer, Accenture Germany",
          "text": "Es war ein großes Privileg für mich, mit einem so talentierten und sachkundigen Entwickler wie Sebastian zusammenzuarbeiten, der sich fließend in der neuesten UI-Tech auskennt. Es ist heutzutage ziemlich schwierig, einen leidenschaftlichen Coder wie ihn zu finden. Wir haben bei unserem letzten Projekt viel aus seinen Erfahrungen mit React, Webpack und seinem EdgeStack gelernt. Ich freue mich darauf, in naher Zukunft wieder mit Sebastian zusammenzuarbeiten."
        }
      ]
    },
    {
      "title": "Neuentwicklung eines Portal für die Planung und Durchführung von Sprachkursen",
      "role": "Senior Frontend Architekt",
      "customer": {
        "name": "Berlitz Deutschland GmbH",
        "location": "Frankfurt am Main"
      },
      "contractor": "Syzygy GmbH, Bad Homburg",
      "period": {
        "start": "2016-10",
        "end": "2017-02"
      },
      "description": [
        "Im Zuge der Neugestaltung und Optimierung des Frontends einer umfangreichen Anwendung, konzentrierte ich mich auf die Implementierung und Architektur im React-Umfeld. Ein Schlüsselelement meiner Arbeit war die Einführung des Apollo Clients und Servers, um GraphQL für eine effiziente Frontend-Backend-Kommunikation zu nutzen. Diese Maßnahme revolutionierte die Datenabfrage- und -manipulationsprozesse durch eine flexiblere Schnittstelle und trug entscheidend zur Performance-Steigerung und Verbesserung der User Experience bei.",
        "Mein Ansatz, der auf einer tiefgehenden Analyse und einem kritischen Blick auf die bestehende Architektur basierte, führte zu einem schlankeren Systemdesign, verbessertem Tooling und der Auswahl adäquater Libraries. Durch diese strategischen Veränderungen konnten wir das Projekt aus einer technologischen Sackgasse führen und auf den Pfad des Erfolgs zurückbringen. Die von mir durchgeführten Anpassungen erhöhten nicht nur die Effizienz und Effektivität des Teams, sondern ermöglichten auch eine nachhaltige Wissensvermittlung und Strukturverbesserung innerhalb des Projekts.",
        "Die positive Resonanz aus meinem Team unterstreicht die transformative Wirkung meiner Arbeit. Als Architekt und Mentor trug ich maßgeblich zur Entwicklung robuster und wartbarer Code-Basen bei, förderte die fachliche Weiterentwicklung des Teams und sorgte für eine konstruktive, lösungsorientierte Atmosphäre."
      ],
      "technologies": [
        "React",
        "Gulp",
        "Webpack",
        "ESLint",
        "StyleLint",
        "PostCSS",
        "CSS Modules"
      ],
      "testimonials": [
        {
          "author": "Jürgen Werle",
          "position": "Senior Web Developer, Syzygy Deutschland GmbH",
          "text": "Vielleicht kennen Sie das ja auch: es gibt diese Projekte die einfach nicht gut laufen - u.a. deswegen, weil technologisch nicht der beste Ansatz verfolgt wurde, wegen hohem Zeitdruck, mangelnder Erfahrung und nicht zuletzt, weil im React-Umfeld derzeit eine besonders hohe Dynamik konkurrierender Ansätze besteht. Solch ein Projekt braucht Expertenwissen und die überzeugende Standhaftigkeit, dass ein besserer Ansatz möglich ist, auch wenn es die Entwicklung zunächst zurück wirft. Sebastian Werner hat sowohl die Kompetenz als auch die Persönlichkeit und lenkte nach ausführlicher Analyse mit den richtigen Konzepten das Projekt in deutlich bessere Bahnen. Eine deutlich schlankere Architektur, verbessertes Tooling und der Einsatz der passenden Libraries waren Schlüssel zum Erfolg. Wir haben viel gelernt und bedanken uns für die Unterstützung - es hat Spaß gemacht!"
        },
        {
          "author": "Claudia Ceh",
          "position": "Frontend Developer, Syzygy Deutschland GmbH",
          "text": "Sebastian konnte mit seiner Expertise viele Probleme lösen und dem Projekt eine gute Struktur geben. Wir waren durch die von ihm vorgestellten Werkzeuge und Architektur effizienter und effektiver. Außerdem konnte er uns viel neues Wissen vermitteln. Er hat sich neben der Rolle des Architekten, auch schnell als Mentor etabliert, der uns half besseren und robusteren JavaScript-Code zu programmieren. Ich konnte einiges lernen und war froh über seine Verbesserungsvorschläge. Mit Hilfe von Sebastian konnten wir in einigen festgefahrenen Situationen wieder einen klaren Blick auf das eigentliche Problem bekommen, dass wir anschließend gemeinsam als Team lösen konnten. Ich hätte mir gewünscht Sebastian von Anfang an im Projekt zu haben, um mit ihm das Projekt robust und stabil aufzubauen."
        },
        {
          "author": "Giso Deutschmann",
          "position": "Architekt und Business Analyst, Freelancer",
          "text": "Sebastian hat umfassendes, tagaktuelles Wissen über alle Aspekte der Entwicklung hochkomplexer Web-Frontends. Den anstehenden Umbau des Frontends zu einer Software, die dem derzeit sehr schnelllebigen Stand der Technik entspricht, hat er mit Hilfe dieses Wissens maßgeblich getrieben. Das Ergebnis war eine vom Frontend-Team als hervorragend anerkannte Lösung. Ich kann Sebastian als Frontend-Architekten, Big-Picture-Menschen und Teamplayer uneingeschränkt empfehlen."
        },
        {
          "author": "Marc Zollingkoffer",
          "position": "Director Software Engineering, Syzygy Deutschland GmbH",
          "text": "Sebastian ist ein erfahrener Berater für Frontend-Technologien. Er zeichnet sich durch sein breites, wie auch tiefes und vor allem aktuelles Wissen zu State-Of-The-Art Technologien aus. Wir haben daher sehr von seiner Unterstützung und Expertise bei der Umsetzung des Frontends mit React-Redux-GraphQL für eine international ausgerichtete Plattform profitiert. Wir haben Sebastian als aktiven Berater erlebt, der auch nicht davor zurückscheut, den Finger - wo notwendig - in die sprichwörtliche Wunde zu legen. Dabei ist er stets konstruktiv und seine Vorschläge unterstützen dabei, das Produkt auf ein verbessertes Niveau zu heben."
        }
      ]
    },
    {
      "title": "Unterstützung der Entwicklung eines neuen Online-Shops",
      "role": "Senior Frontend Architekt",
      "customer": { "name": "Hornbach Baumarkt AG", "location": "Bornheim" },
      "contractor": "Systeme24, Mainz",
      "period": {
        "start": "2016-05",
        "end": "2016-09"
      },
      "description": [
        "Bei der Umstellung der Styling-Plattform auf PostCSS entwickelte ich eine Tooling-Lösung, die Hot Module Replacement (HMR) für React mit Server-Side Rendering (SSR) unterstützt. Die Implementierung von React-Intl ermöglichte die Internationalisierung der Anwendung, während Techniken wie Tree-Shaking und automatische Chunks die Effizienz und Leistung verbesserten. Ziel war es, eine konsistente und reaktionsfähige Nutzererfahrung über eine Vielzahl von Plattformen hinweg zu gewährleisten, einschließlich Desktop-Browsern, Tablet-Browsern und Smartphone-Browsern. Diese strategische Überarbeitung führte zu einer Optimierung der Ladezeiten und einer signifikanten Verbesserung der allgemeinen Benutzerfreundlichkeit."
      ],
      "technologies": ["React", "Redux", "React-Intl", "PostCSS", "Webpack"],
      "testimonials": []
    },
    {
      "title": "Architektur für innovative neue Robo-Advisor Web-Anwendung der Deutschen Bank Gruppe",
      "role": "Senior Frontend Architekt",
      "customer": {
        "name": "Deutsche Asset & Wealth Management",
        "location": "Frankfurt am Main"
      },
      "contractor": "Questax GmbH",
      "period": {
        "start": "2015-11",
        "end": "2016-04"
      },
      "technologies": ["VueJS", "JSPM", "Gulp", "Sass", "JavaScript"],
      "description": [
        "Während meiner Beratungstätigkeit für die Frontend-Architektur einer innovativen internationalen Investment-Plattform stand die Entwicklung einer Single Page Application (SPA) im Mittelpunkt, die sich durch live aktualisierte Charts und international formatierte Werte, wie Währungen, auszeichnet. Die von mir gewählte Technologieauswahl und die sorgfältige Projektstrukturierung spielten eine entscheidende Rolle dabei, die komplexen Anforderungen des Projekts effizient zu erfüllen und eine Plattform zu gestalten, die sowohl robust als auch benutzerfreundlich ist.",
        "Meine Arbeitsweise, geprägt durch Präzision und Gewissenhaftigkeit, ermöglichte es, einen umfassenden Überblick über die Frontend-Technologien zu bewahren und sowohl die Vorteile als auch die Herausforderungen gängiger Ansätze, Tools und Frameworks genau zu evaluieren. Durch eine detaillierte Analyse der Interaktionen zwischen Frontend und Benutzern konnte ich Schwächen in den UI-Konzepten frühzeitig identifizieren und beheben. Die resultierende Frontend-Architektur, die ich entwickelte, trug nicht nur zur Steigerung des Projektwerts bei, sondern legte auch den Grundstein für eine solide Basis, die sich im weiteren Verlauf des Projekts als äußerst robust erwies."
      ],
      "testimonials": [
        {
          "author": "Mark Paluch",
          "position": "CTO / Consultant, Freelancer",
          "text": "Sebastian Werner arbeitet sehr gewissenhaft und genau. Er hat einen immensen Überblick über die Technologien im Frontend-Bereich und kennt sowohl die Benefits als auch die Nachteile gängiger Ansätze, Tools und Frameworks. Sebastian analysiert sehr genau die Abläufe und Interaktionen zwischen Frontend und Benutzer. Dadurch können Schwächen in den UI Konzepten frühzeitig adressiert und behoben werden. Die in dem Projekt geschaffene Frontend-Architektur schuf einen erheblichen Mehrwert und klare Strukturen die sich im späteren Projektverlauf als sehr solide Basis erwiesen haben."
        },
        {
          "author": "Kai Bald",
          "position": "Project Lead, Deutsche Asset & Wealth Management",
          "text": "Sebastian Werner ist ein sehr erfahrener Front-end Entwickler und Architekt, der darüber hinaus den holistischen Blick auf das gesamte Projekt im Auge behält. Seine Kompetenz bringt er vollumfänglich ein und setzt sich sehr mit den Themen auseinander. Er arbeitet fokussiert, gewissenhaft sowie dennoch schnell und konnte sich so erfolgreich in das Projekt einbringen."
        }
      ]
    },
    {
      "title": "Aufwendig animiertes Frontend für die neue Telekom-Entertain-Plattform",
      "role": "Senior User Interface Architekt",
      "customer": { "name": "Huawei Technologies", "location": "Darmstadt" },
      "contractor": "Networkers International",
      "period": {
        "start": "2014-06",
        "end": "2015-10"
      },
      "description": [
        "In meiner beratenden Rolle für die Software-Architektur einer neuen, international ausgerichteten Plattform war ich maßgeblich an der Entwicklung und Optimierung einer Single Page Application (SPA) beteiligt. Mein Fokus lag auf der Einführung eines MVP-Konzeptes zur Verbesserung der Modularität und Struktur des Codes, was wesentlich zur Steigerung der Effizienz und Benutzerfreundlichkeit der Plattform beitrug. Ich leitete die Implementierung eines anspruchsvollen, interaktiven Interfaces, das fortschrittliche UI-Übergänge ermöglichte, und koordinierte die Entwicklungsstrategien zwischen Offshore- und Onsite-Teams. Diese Koordination umfasste eine enge Zusammenarbeit mit internationalen Teams, insbesondere mit chinesischen Mitarbeitern von Huawei und der Deutschen Telekom, wobei ich nicht nur technische, sondern auch kulturelle und sprachliche Herausforderungen erfolgreich meisterte.",
        "Ein weiterer Schwerpunkt meiner Tätigkeit war die Sicherstellung der Softwarequalität durch die Entwicklung umfassender Tests, einschließlich Unit- und UI-Tests. Ich übernahm auch die Verantwortung für die Dokumentation des Codes und das Management der Tooling-Prozesse für Entwicklung und Deployment, was eine konsistente und effiziente Arbeitsumgebung schuf.",
        "Die Zusammenarbeit in einem internationalen Kontext stellte besondere Herausforderungen dar, insbesondere im Hinblick auf Sprachbarrieren und unterschiedliche Erwartungshaltungen an Qualität und Arbeitsweise. Meine Erfahrung in der Arbeit mit vielfältigen Teams ermöglichte es mir jedoch, diese Herausforderungen erfolgreich zu navigieren und eine effektive Kommunikation und Zusammenarbeit zwischen allen Beteiligten zu fördern. Dies trug maßgeblich dazu bei, die Projektziele zu erreichen und eine solide Grundlage für zukünftige Entwicklungen zu legen."
      ],
      "technologies": [
        "Velocity.js",
        "LessJS",
        "Jasmine",
        "DalekJS",
        "JSDuck",
        "Grunt"
      ],
      "testimonials": [
        {
          "author": "Joakim Martensson",
          "position": "Senior UI/UX Designer, Huawei Technologies",
          "text": "Sebastian and I have worked in the same project for about 1.5 years now and I've come to know him as a person who has a very good knowledge of his field and is always keen on keeping up-to-date on the latest developments - which is not an easy thing when technology advance as fast as it does in this business. Sebastian also show a willingness to think outside the box (to use an old cliché) and tries to figure out new, better and more efficient ways of doing things. He's also proven to have a good feel and consideration for the impact of his work on the end-user experience. As a plus, he's also a nice and amendable person that I think would easily fit in with most teams."
        },
        {
          "author": "Gerlando La Porta",
          "position": "Management Consulting, Archtexx Consulting",
          "text": "Sebastian was part of our agile development team and I worked with him as a product owner. Sebastian is an excellent web application / UI developer. He was one of our technical key UI architects who defined the UI architecture and build major elements of those UI elements. He is innovative, focuses on details and delivers solution."
        },
        {
          "author": "Mario Günzel",
          "position": "Product Manager TV Platforms & User Experience, Deutsche Telekom",
          "text": "Sebastian Werner does a great job in our project. He has very good development and consultant skills and brings in solutions idea to make our project successful."
        },
        {
          "author": "Ingo Müller",
          "position": "Senior Product Manager, Deutsche Telekom",
          "text": "I can recommend Sebastian as a person with great expertise and deep background of web architecture and Frontend development. He is a thought leader in his field. As a innovative strategist he understands complex matters even when outside of his direct area of expertise. He shows all the time a lot of analytical capability and willingness for his both personal & professional development. He is ambitious and smart. His open-minded approach could not be overestimated."
        },
        {
          "author": "Sascha Lee",
          "position": "Visual Designer, Deutsche Telekom",
          "text": "In a huge collaboration project I recognized Sebastian as a very skilled and qualified teammate. From a design perspective he served as a convergent bridge between design and technology and pushed the project to a higher level with his expertise."
        },
        {
          "author": "Patric Schouler",
          "position": "Expert ICT Systemengieering, Deutsche Telekom",
          "text": "I enjoyed the time to work together with Sebastian in a challenging project at Deutsche Telekom for our TV Delivery Devision. Sebastian has worked for us in a international team as UI Architekt and JavaScript/HTML Consultant. In our project we are focusing to build the new user interface for the product Entertain TV. His very high skills in web development was very helpful and Sebastian did a professional job. Especially his work on some reusable user interface components was very impressive and helps our project and other teams at Deutsche Telekom a lot. Thank you for your work, I would like to work with you every time again."
        }
      ]
    },

    {
      "title": "Responsive Homepage für den Software-Hersteller MAGIX",
      "role": "Senior Frontend Developer",
      "customer": {
        "name": "Triplesense Reply",
        "location": "Frankfurt am Main"
      },
      "period": {
        "start": "2013-11",
        "end": "2014-02"
      },
      "description": [
        "In diesem Projekt integrierten wir ein führendes CSS-Framework, um eine responsive und optisch ansprechende Webseite zu entwickeln, die sich nahtlos an unterschiedliche Bildschirmauflösungen anpasst. In enger Abstimmung mit den Design- und Konzeptteams schufen wir eine wartungsarme und flexibel gestaltete Webseite, die ein magazinartiges Design mit hochwertiger Typografie kombiniert. Zu den Schlüsselelementen gehörten eine Sticky-Funktion für wichtige Webseitenbereiche sowie ein interaktiver, tabellarischer Produktvergleich, der Nutzern detaillierte Vergleiche ermöglicht."
      ],
      "technologies": [
        "Modular Scales",
        "ImageOptim",
        "Jasy",
        "Sass",
        "Uglify"
      ],
      "testimonials": [
        {
          "author": "Astrid Fischer",
          "position": "Konzept / Information Architekt, Triplesense Reply",
          "text": "Sebastian ist ein überaus motivierter, mitdenkender und kreativer Entwickler. Er hat sich im Team gut integriert und die Meetings durch viele Ideen und innovative Lösungsansätze bereichert. Darüber hinaus hat die Arbeit mit ihm Spaß gemacht, weil er auch menschlich gut ins Team gepasst hat."
        }
      ]
    },
    {
      "title": "Erweiterung der Webseite des Kabelanbieters Tele Columbus",
      "role": "Senior Frontend Developer",
      "customer": {
        "name": "Triplesense Reply",
        "location": "Frankfurt am Main"
      },
      "period": {
        "start": "2013-04",
        "end": "2013-12"
      },
      "technologies": ["HTML5", "RPC", "Google Ads"],
      "description": [
        "Bei der Umsetzung der Photoshop-Designs in funktionierende Webanwendungen für iPhones und Android-Geräte nutzte ich HTML5-Technologie, um eine hochperformante Rich Internet Application (RIA) zu entwickeln. Diese App zeichnete sich durch interaktive Layer-Wechsel ohne den klassischen Seitennachladeeffekt aus. Die Implementierung einer MVP-basierten Architektur mit Template-Rendering basierte auf einem Core-Framework, wodurch eine strukturierte und wartbare Codebasis sichergestellt wurde. Für die HTML5-Formularvalidierung setzte ich auf interaktive Rückmeldungen zu Fehlerzuständen, um die Benutzererfahrung zu verbessern. Die Anbindung an ein bestehendes, PHP-basiertes Backend erfolgte über RPC, was eine nahtlose Datenintegration ermöglichte. Zudem integrierte ich Werbe- und Tracking-Netzwerke durch intelligente, nachgelagerte Einbindung, um Marketingziele effektiv zu unterstützen, ohne die Nutzererfahrung zu beeinträchtigen."
      ]
    },
    {
      "title": "Leitung der Architektur des neuen Telefoniecenters Frontends",
      "role": "JavaScript Architekt",
      "customer": { "name": "axxessio GmbH", "location": "Bonn" },
      "contractor": "Deutsche Telekom, Darmstadt",
      "period": {
        "start": "2012-11",
        "end": "2013-04"
      },
      "technologies": ["Jasy", "jQuery", "HTML5", "VOIP", "RIA", "REST", "MVP"],
      "description": [
        "In der Rolle des leitenden Entwicklers übernahm ich die Herausforderung, eine Rich Internet Application (RIA) für die Konfiguration von VOIP-Merkmalen für Festnetzanschlüsse zu entwickeln. Unser Ziel war es, die fortschrittlichen Möglichkeiten moderner Desktop-Browser ab Internet Explorer 9 voll auszuschöpfen, um den Benutzern eine nahtlose und intuitive Konfigurationserfahrung zu bieten. Die effiziente Anbindung an ein existierendes Backend-System über einen REST-Proxy ermöglichte eine direkte Kommunikation zwischen Frontend und Backend, wodurch die Grundlage für eine dynamische und reaktionsfähige Anwendung gelegt wurde.",
        "Durch die Implementierung von Live-Feedback und HTML5-Formularvalidierung, kombiniert mit einer intelligenten Hintergrund-Synchronisation, konnte ich die Benutzerinteraktion signifikant verbessern. Dies erhöhte nicht nur die Zufriedenheit der Endnutzer, sondern trug auch dazu bei, Fehlerquellen zu minimieren und die Datenintegrität zu sichern. Die Anwendung basierte auf einer soliden MVP-Architektur, die durch Template-Rendering ergänzt wurde, um eine klare Trennung von Präsentation und Logik zu gewährleisten."
      ],
      "testimonials": [
        {
          "author": "Matthias Huthmacher",
          "position": "Projekt Manager, Deutsche Telekom",
          "text": "Sebastian was the driving force making our SCRUM Team successful. His strong programming skills combined with a keen perception helped us, to release a web application for telephony configuration using state of the art web technologies. Sebastian is a great guy with an enormous knowledge about modern software design and software architecture. I really enjoyed working with him!"
        },
        {
          "author": "Chris Bauer",
          "position": "Creative Consultant, HEADSPACE Hamburg",
          "text": "Sebastian Werner beweist erstklassige Qualitäten bei der Entwicklung von RIA-Oberflächen und ist ein exzellenter Sparringspartner in komplexen SCRUM-Projekten."
        }
      ]
    },

    {
      "title": "Bahnbrechende Grundlagen-Technologie zur HTML5-basierten Umsetzung von Internet-Spielen als Ersatz für Flash",
      "role": "Senior JavaScript Developer",
      "customer": {
        "name": "Zynga Germany GmbH",
        "location": "Frankfurt am Main"
      },
      "period": {
        "start": "2011-04",
        "end": "2012-11"
      },
      "description": [
        "Während meiner Zeit bei Zynga nahm ich die herausfordernde Aufgabe an, die Architektur und Entwicklung eines hardware-beschleunigten Scrollers für umfangreiche Spielfelder zu leiten. Dieses innovative Projekt zielte darauf ab, ein nahtloses Scroll-Erlebnis zu ermöglichen, das dem von iOS ähnelt – einschließlich Bouncing und Deceleration. Parallel dazu führte ich signifikante Verbesserungen in unserem Tooling-System durch, indem ich neue Funktionen wie einen API-Browser, Scaffolding, einen lokalen Webserver mit Proxy-Funktion, die Integration in die Asset-Management-Infrastruktur von Zynga sowie einen SpriteSheet-Generator implementierte.",
        "Ein weiterer wesentlicher Bestandteil meiner Arbeit war die kontinuierliche Weiterentwicklung des verwendeten JavaScript-Frameworks. Dazu gehörte die Einführung von Polyfills für ES5-Methoden zur Sicherstellung der Kompatibilität mit älteren Browsern, die Unterstützung von Multi-Wert-Eigenschaften in Klassen-Deklarationen und die Entwicklung von effizienten Ladesystemen für Skripte, Stylesheets und Bilder. Diese Verbesserungen waren entscheidend, um die Performance und die Benutzererfahrung unserer Anwendungen zu steigern."
      ],
      "technologies": ["iOS", "Jasy", "Polyfill", "ES5"],
      "testimonials": [
        {
          "author": "Paul Bakaus",
          "position": "CTO, Zynga",
          "text": "Sebastian war eine unschätzbarer Teil des Teams unseres Technologie Studios für Zynga in Frankfurt. Er besitzt die Fähigkeit zu analysieren wie ein Feature idealerweise funktionieren sollte, anstatt genau nach Vorgaben zu handeln, und verbessert somit sehr häufig das gesamte Produkt. Er betrachtet Software-Architektur von allen Ecken ganzheitlich und gewinnt so oft souverän die Oberhand in überhitzten Diskussionen, vor allem weil er sich immer für den Kunden des Produkts einsetzt. Eine Eigenschaft, die Sebastian und ich uns teilen, ist das Auge für Details, insbesondere für Design, User Experience und Feinschliff. Man findet äußerst selten einen so guten JavaScript-Entwickler, der gleichzeitig skalierbare Architekturen planen kann und selbstverständlich Wert auf Layout, UI und UX legt."
        },
        {
          "author": "Christoph Martens",
          "position": "JavaScript Engineer, Zynga",
          "text": "Working with Sebastian was always a pleasure. He has a vastly-founded knowledge about UI architectures and compiling architectures in JavaScript. He founded the Jasy project, which is the underlying web framework at Zynga allowing to publish everything automagically to S3 et al. Very talented guy, would love to work with him again."
        },
        {
          "author": "Matthew Jaquish",
          "position": "Developer, Zynga",
          "text": "I have had great experiences collaborating with Sebastian on various projects. I have used his software and tools extensively and found him eager to listen to feedback and make changes accordingly. He never hesitates to answer questions personally. I appreciate his architecture choices because they are forward-thinking, maintainable, and extensible."
        }
      ]
    },
    {
      "title": "Innovative Cross-Plattform-Entwicklung für Smartphone-Angebote auf HTML5-Basis",
      "role": "Senior Software Developer",
      "customer": { "name": "Deutsche Telekom", "location": "Darmstadt" },
      "period": {
        "start": "2009-03",
        "end": "2011-03"
      },
      "description": [
        "Meine Tätigkeit konzentrierte sich auf die Analyse zukünftiger Entwicklungen im Mobilfunkmarkt und die Etablierung von Web-Technologien, um den Multi-Plattform-Ansatz der Deutschen Telekom zu unterstützen. Im Zuge dessen entwickelte ich die Fußball.de-Fan-App mit Unify und PhoneGap, deren Funktionsweise in einem Demo-Video auf YouTube präsentiert wurde. Zudem initiierte ich das OpenSource Framework Unify, entwickelte eine allgemeine Navigationslogik für mobile Anwendungen und leitete die Ausarbeitung zur Beantragung von Patenten für die geschaffenen Lösungen ein.",
        "Die Basisarbeiten zur Integration von Unify in native Anwendungen umfassten den Einsatz von PhoneGap, QtWebkit und Adobe AIR. Ich stellte das Framework auf internen und externen Events vor und kooperierte mit den T-Labs, T-Mobile sowie weiteren Mobilfunk-Anbietern und -Herstellern zur Integration von Unify in die BONDI-Initiative bzw. WAC.",
        "Darüber hinaus war ich für die Entwicklung der PagePlace-Anwendung für Desktop-Browser und einer RIA-Anwendung auf Basis des qooxdoo-Frameworks zuständig, die das Lesen von Büchern und das Verwalten von Abonnements ermöglichte. Diese Arbeit beinhaltete das Parsen und Aufbereiten von ePub-basierten Büchern inklusive Entschlüsselung und Rendering innerhalb der Anwendung sowie die Implementierung einer komplexen Animationsmechanik für qooxdoo-basierte Anwendungen und die Entwicklung eines eigenen Themes, das auf dem internen Styleguide basierte."
      ],
      "technologies": [
        "PhoneGap",
        "QtWebkit",
        "Adobe AIR",
        "Unify",
        "BONDI",
        "WAC",
        "qooxdoo",
        "ePub"
      ],
      "testimonials": [
        {
          "author": "Bernhard Hochstätter",
          "position": "Head of Mobile Solutions, Deutsche Telekom",
          "text": "Developer with excellent skills in web technologies, always ahead with technology and market trends. Great guy."
        },
        {
          "author": "Rocco Georgi",
          "position": "IT Consultant",
          "text": "Ich war sehr froh mit Sebastian arbeiten zu dürfen. Er ist ein echter Experte vor allem in Sachen JavaScript und Python. Er kann aber auch in Sachen UI/UX überzeugen. Ich konnte viel von Ihm lernen und ich würde jederzeit gern wieder mit ihm arbeiten."
        },
        {
          "author": "Jochen Hiller",
          "position": "Developer Evangelist, Deutsche Telekom",
          "text": "Sebastian is a smart Web 2.0 guy, I worked together the last year. He is deeply involved in Browser, JavaScript, CSS, HTML technologies and always knows about the latest development and trends. I can recommend working together with him and enjoy common time and work."
        },
        {
          "author": "Alexander Dittner",
          "position": "Softwareentwickler, Deutsche Telekom",
          "text": "Mentor, Teamleiter und ein hervorragender Entwickler."
        },
        {
          "author": "Marek Pawlowski",
          "position": "Consultant, Web Desire",
          "text": "Working with Sebastian was a big pleasure. He has brilliant ideas all the time based on his experience and huge development knowledge. He put to our work great dose of organization and he has immense influence on code quality in our application. I'm still impressed by his knowledge about frameworks, JavaScript and Python development."
        }
      ]
    },
    {
      "title": "Architekturelle Verbesserung, Performance-Optimierung und Implementierung von Komponenten für Soziales Netzwerk",
      "role": "Teamlead JavaScript Development",
      "customer": { "name": "studiVZ", "location": "Berlin" },
      "period": {
        "start": "2008-10",
        "end": "2009-02"
      },
      "technologies": ["JavaScript", "HTML5", "Ajax"],
      "description": [
        "Ich leitete ein Team von vier Frontend-Spezialisten bei der Entwicklung neuartiger Oberflächen für eines der größten europäischen sozialen Netzwerke, das sich an Schüler, Studenten und Erwachsene richtet. Unser Fokus lag auf der Neuentwicklung und Verbesserung bestehender Oberflächenkomponenten. Ein Schlüsselprojekt war die Entwicklung eines Foto-Betrachters, der Nutzern die Möglichkeit bietet, Personen auf Fotos zu markieren. Diese Arbeit trug maßgeblich dazu bei, die Interaktivität und Benutzerfreundlichkeit der Plattform zu erhöhen und den Austausch unter den Nutzern zu fördern."
      ],
      "testimonial": "Sebastian has extensive knowledge in his field, and is always able to adapt newest technical developments to the benefit of the product he is working on. Using those skills to the fullest, he helped improve our product significantly. - Wojciech Duda, studiVZ"
    },
    {
      "title": "Initiierung, Architektur und Entwicklung des qooxdoo JavaScript-Frameworks",
      "role": "Senior Software Developer",
      "customer": { "name": "1&1 Internet AG", "location": "Karlsruhe" },
      "period": {
        "start": "2004-11",
        "end": "2008-09"
      },
      "description": [
        "Vor zwei Jahrzehnten wagte ich mich mit meinem Team an die Entwicklung eines visionären Widget-Systems, inspiriert von den ausgefeilten Merkmalen nativer UI-Toolkits wie Qt. Unser Ziel war es, die Möglichkeiten webbasierter Anwendungen grundlegend zu erweitern und eine Schnittstelle zu schaffen, die Layout-Queues, Child-/Shadow-Widgets und ein fortschrittliches Styling einschließlich Schatten, dynamischen Dekorateuren und Farbverläufen bot. Diese Technologien sollten die Art und Weise, wie Interaktionen im Web gestaltet werden, neu definieren.",
        "Die Herausforderung bestand darin, diese komplexen Konzepte in einer Zeit umzusetzen, in der Webbrowser noch nicht für derartige Innovationen ausgerüstet waren. Unsere Arbeit führte zu einer Python-basierten, plattformübergreifenden Tooling-Lösung, die nicht nur die Zusammenstellung, Optimierung und Internationalisierung ermöglichte, sondern auch die Grenzen dessen, was im Web machbar ist, neu definierte. Trotz der späteren Einstellung des Projekts, war die gewonnene Erkenntnis, dass wir das Potenzial des Webs signifikant erweitern konnten, ein wahrer Durchbruch.",
        "Meine Erfahrungen und das Feedback aus der Community zeigen, dass Visionen, gepaart mit Entschlossenheit und technischem Know-how, die Entwicklung der digitalen Welt vorantreiben können."
      ],
      "technologies": ["qooxdoo", "Python", "JavaScript"],
      "testimonials": [
        {
          "author": "Chris Ricks",
          "position": "SecurePay Group Pty Ltd",
          "text": "I have been using qooxdoo for external and internal projects for a while. Sebastian has always been extremely helpful and accomodating when answering questions about qooxdoo and accepting contributions. His direct, to-the-point and pragmatic style is an excellent asset."
        },
        {
          "author": "Tobias Oetiker",
          "position": "Oetiker+Partner, Olten, Switzerland",
          "text": "I know Sebastian through his work on the qooxdoo library which is the coolest thing I have seen in a long time."
        },
        {
          "author": "Christian Boulanger",
          "position": "Humboldt Universität, Berlin",
          "text": "I worked with Sebastian during development of an open source software project which relies on the qooxdoo JavaScript GUI toolkit developed at Sebastian's company. His fast, competent and friendly support on every aspect of the toolkit was crucial for the successful development of my application. I can recommend him as collaborator in open source and other projects, and his leading role in the qooxdoo project was clearly visible."
        },
        {
          "author": "Paul Morel",
          "position": "Tartan Solutions Inc., USA",
          "text": "Sebastian is a visionary who has the unique ability to put his extraordinary vision into practice. Sebastian's work on the qooxdoo toolkit provided capabilities and insight that no other toolkit has matched. His ability to combine performance, power, and ease of use is truly a welcome sight. There is no doubt that he will continue to be a driving force in the industry."
        },
        {
          "author": "Michael Rea",
          "position": "Tartan Solutions Inc., USA",
          "text": "Sebastian ranks among the most influential people in the Web 2.0 space. Sebastian's ingenious work on the architecture of the qooxdoo framework has resulted in a fully functional and easy-to-deploy open source JavaScript UI. The Open Source Ajax community is indebted to Sebastian for his awesome work on qooxdoo."
        }
      ]
    },

    {
      "title": "Online-Shop der DSL-Marke 1&1 mit XSLT-basiertem Backend-Rendering",
      "role": "Web Developer",
      "customer": {
        "name": "Schlund+Partner GmbH & Co. KG",
        "location": "Karlsruhe"
      },
      "period": {
        "start": "2002-05",
        "end": "2004-10"
      },
      "technologies": ["Pustefix", "XSLT", "HTML", "CSS", "JavaScript"],
      "description": [
        "Ich übernahm die Gestaltung des Online-Auftritts, des Bestellvorgangs und die Kreation von Newsletter-Kampagnen, wobei mein Fokus auf der Umsetzung von HTML-Markup und CSS basierend auf vorgefertigten Designs lag. In der Zusammenarbeit mit Backend-Entwicklern spielte ich eine Schlüsselrolle bei der Dynamisierung der Inhalte, um eine lebendige und interaktive Nutzererfahrung zu schaffen. Ein wesentlicher Bestandteil meiner Arbeit war die Entwicklung von XSLT-Templates zur Anzeige von Produkt-Vergleichen, Produktseiten und weiteren Elementen unter Einsatz des Pustefix-Frameworks, das für seine rekursive XSLT-Engine bekannt ist. Darüber hinaus setzte ich JavaScript-Komponenten für das Control-Center um, einschließlich Toolbars, Menüs und Umschaltern, die durch einfache HTML-Attribute steuerbar sind. Diese Komponenten trugen maßgeblich dazu bei, die Bedienbarkeit und Funktionalität der Website zu verbessern und ein nahtloses Einkaufserlebnis für die Nutzer zu gewährleisten."
      ],
      "testimonials": [
        {
          "author": "Jens O. Meiert",
          "position": "GMX GmbH",
          "text": "Long story short: Sebastian is a highly skilled JavaScript/DOM Scripting Magician with whom it always was/is a pleasure to work."
        }
      ]
    },
    {
      "title": "IT-Beratung, Programmierung und Support",
      "role": "Software Developer",
      "customer": {
        "name": "Paritätische Sozialdienste",
        "location": "Minden"
      },
      "period": {
        "start": "2001-01",
        "end": "2002-04"
      },
      "technologies": [
        "Visual Basic for Applications (VBA)",
        "Adobe InDesign",
        "Adobe Flash",
        "Combit Adressmanager",
        "HTML",
        "JavaScript",
        "ActionScript",
        "XML"
      ],
      "description": [
        "Bei diesem Projekt war ich verantwortlich für die Umsetzung eines Datenbank-Interfaces mit dem Combit Adressmanager. Ich entwickelte VBA-Makros für Word, um die Erstellung von Etiketten und Serienbriefen zu vereinfachen. Parallel dazu gestaltete ich die Selbsthilfe-Zeitung mit Adobe InDesign 1.5 und koordinierte mit der Druckerei, um die Einbettung von Schriften und die Realisierung der Farbtreue zu gewährleisten.",
        "Ein weiterer wichtiger Aspekt meiner Tätigkeit war die Einarbeitung einer Mitarbeiterin in die Nutzung der Software, mit der wir gemeinsam die erste Ausgabe der Zeitschrift erstellten. Zusätzlich übernahm ich die Erstellung der Homepage, deren Inhalte als XML-Dateien von Mitarbeitern leicht angepasst werden konnten. Für die Webseite implementierte ich ein dynamisches Menü-System auf Basis von Flash, verbesserte die Nutzerführung und interaktive Elemente der Seite.",
        "Zum Abschluss des Projekts führte ich Schulungen für das Team durch und erstellte eine umfassende Dokumentation zur Pflege der Homepage-Inhalte, um eine nachhaltige und benutzerfreundliche Verwaltung der Webpräsenz zu gewährleisten."
      ]
    }
  ]
}
